{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "th", "nb_filter": 32, "nb_col": 3, "b_regularizer": null, "border_mode": "same", "batch_input_shape": [null, 3, 32, 32], "trainable": true, "input_dtype": "float32", "bias": true, "init": "glorot_uniform", "W_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_1", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "th", "nb_filter": 32, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true, "init": "glorot_uniform", "W_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_2", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "th", "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "border_mode": "same", "trainable": true, "bias": true, "init": "glorot_uniform", "W_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_3", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "dim_ordering": "th", "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "trainable": true, "bias": true, "init": "glorot_uniform", "W_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_4", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 512, "activation": "linear", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_regularizer": null, "trainable": true, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 10, "activation": "linear", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "softmax"}}]}